#coding:utf8
s='''
备案号	苏苏械备20180345号
备案人名称	碧迪快速诊断产品（苏州）有限公司
备案人注册地址	苏州工业园区出口加工区B区瑞浦路9号
生产地址	苏州工业园区出口加工区B区瑞浦路9号
产品名称	CD33检测试剂
型号规格	100检测人份
产品描述	本试剂的主要组成成分是荧光PE标记的CD33单克隆抗体。装瓶浓度是每2.0mL磷酸盐缓冲液（PBS）中含24µg。
预期用途	检测人体生物标本中CD33的表达，为医师提供诊断的辅助信息。
备注	
备案单位	苏州市市场监督管理局
备案日期	2020-09-15
变更情况	
'''
import re

# results=re.findall(r'注册证编号	([\s\S]*?)\n注册人名称	([\s\S]*?)\n注册人住所[\s\S]*?型号规格	([\s\S]*?)\n',s)
# result=re.findall(r'备案号	([\s\S]*?)\n[\s\S]*?产品名称	([\s\S]*?)\n[\s\S]*?型号规格	([\s\S]*?)\n[\s\S]*?产品描述	([\s\S]*?)\n',f.read())
# print(*result)

# 备案号
# 产品名称
# 型号规格
# 产品描述

print(55843.4*11/13+55920.4*2/13-(55674*25/27+55920.4*2/27))
print(195.1*0.8+163*0.2)
print(2*(162.99430199430208-188.68))
# print(55674*25/27+55920.4*2/27)
a={"b":1,"d":2}
b={"c":3,"a":4}
a.update(b)
print(a)
import datetime,time
print(datetime.datetime.now().minute)
print(type(datetime.datetime.now().minute))
print(180-int(time.time())%180)